In [1]:
#importing Libraries
import pandas as pd
import sqlite3 as db

In [2]:
#Creating a new SQLite Movies database 
#Connecting to the SQLite database and establishing connection to movies database
#if unable to open database then change the location to current working directory to where the database is created
conn=db.connect(r'C:\Users\STEVEN\Desktop\MuleSoft Training assessment- Steven Mascarenhas\sqlite\db\Movies.db')

In [3]:
#Creating a Cursor object by calling the cursor() method of the Connection object.
cn=conn.cursor()

In [4]:
#incase u want to drop a table if already exists use this(just for checking if table already exists )
cn.execute("DROP TABLE Movies")

In [5]:
#Creating tables in SQLite database using Python
# the execute() method of the Cursor object to execute the CREATE TABLE statement.
cn.execute("CREATE TABLE Movies( MovieId INTEGER PRIMARY KEY,MovieName Varchar(100),Actor Varchar(100),Actress Varchar(100),Director Varchar(100) ,Year_Of_Release Date)")

In [6]:
#listing the tables in SQLite database
cn.execute("SELECT name FROM sqlite_master WHERE type='table';")
#fetchall() fetches all (remaining) rows of a query result, returning a list.
print(cn.fetchall())

[('Movies',)]

In [7]:
#Inserting data into the SQLite database using Python
#The execute() method of the Cursor object to execute the Insert into statement.
#Inserting data into Movies table 
cn.execute("INSERT INTO Movies VALUES (1,'Spider-Man: No Way Home','Tom Holland','Zendaya','Jon Watts','16-12-2021')")
cn.execute("INSERT INTO Movies VALUES (2,'The Batman','Robert Pattinson','Zoë Kravitz','Matt Reeves','04-04-2022')")
cn.execute("INSERT INTO Movies VALUES (3,'Avatar 2','Sam Worthington','Zoe Saldaña','James Cameron','16-12-2022')")
cn.execute("INSERT INTO Movies VALUES (4,'Fantastic Beasts: The Secrets of Dumbledore','Johnny Depp','Katherine Waterston','David Yates','08-04-2022')")
cn.execute("INSERT INTO Movies VALUES (5,'Uncharted','Tom Holland','Sophia Taylor Ali', 'Ruben Fleischer','18-02-2022')")

In [8]:
#Querying data from Movies table 
cn.execute("SELECT * FROM Movies;")
#fetchall() fetches all (remaining) rows of a query result, returning a list.
print(cn.fetchall())

[(1, 'Spider-Man: No Way Home', 'Tom Holland', 'Zendaya', 'Jon Watts', '16-12-2021'), (2, 'The Batman', 'Robert Pattinson', 'Zoë Kravitz', 'Matt Reeves', '04-04-2022'), (3, 'Avatar 2', 'Sam Worthington', 'Zoe Saldaña', 'James Cameron', '16-12-2022'), (4, 'Fantastic Beasts: The Secrets of Dumbledore', 'Johnny Depp', 'Katherine Waterston', 'David Yates', '08-04-2022'), (5, 'Uncharted', 'Tom Holland', 'Sophia Taylor Ali', 'Ruben Fleischer', '18-02-2022')]

In [9]:
#Querying data from Movies table with parameters
#Using a query with parameter like actor name to select movies based on the actor's name.
cn.execute(" select MovieName from Movies where Actor ='Tom Holland';")
#fetchall() fetches all (remaining) rows of a query result, returning a list.
print(cn.fetchall())

[('Spider-Man: No Way Home',), ('Uncharted',)]

In [10]:
#commiting changes to the sqlite movies database
conn.commit()

In [11]:
#closing the cursor object
cn.close()
#closing the movies database connection
conn.close()

In [12]:
con = db.connect(r'C:\Users\STEVEN\Desktop\MuleSoft Training assessment- Steven Mascarenhas\sqlite\db\movies.db')
#Pandas read sequel query method to return data as pandas databframe
#returns the data as in the Movies database  as pandas dataframe 
df_Movies = pd.read_sql_query('select * from Movies', con)

In [13]:
df_Movies

,MovieId,MovieName,Actor,Actress,Director,Year_Of_Release
0,1,Spider-Man: No Way Home,Tom Holland,Zendaya,Jon Watts,16-12-2021
1,2,The Batman,Robert Pattinson,Zoë Kravitz,Matt Reeves,04-04-2022
2,3,Avatar 2,Sam Worthington,Zoe Saldaña,James Cameron,16-12-2022
3,4,Fantastic Beasts: The Secrets of Dumbledore,Johnny Depp,Katherine Waterston,David Yates,08-04-2022
4,5,Uncharted,Tom Holland,Sophia Taylor Ali,Ruben Fleischer,18-02-2022

In [14]:
#returns the data as in the Movies database  as pandas dataframe with a parameter like actor name to select movies based on the actor's name.

df_Movies1 = pd.read_sql_query("select MovieName,Actor from Movies where actor ='Tom Holland' ", con)

In [15]:
df_Movies1

                 MovieName        Actor
0  Spider-Man: No Way Home  Tom Holland
1                Uncharted  Tom Holland

In [16]:
#closing the connection
con.close()